yo_tsuun_to_hangul = {
    "きゃっ":"캿",  "きゅっ":"큣",    "きょっ":"쿗",    "きゃん":"캰",  "きゅん": "큔",   "きょん": "쿈",
    "しゃっ":"샷",  "しゅっ":"슛",    "しょっ":"숏",    "しゃん":"샨",  "しゅん": "슌",   "しょん": "숀",        
    "ちゃっ":"챳",  "ちゅっ":"츗",    "ちょっ":"춋",    "ちゃん":"챤",  "ちゅん": "츈",   "ちょん": "쵼",
    "にゃっ":"냣",  "にゅっ":"늇",    "にょっ":"뇻",    "にゃん":"냣",  "にゅん": "뉸",   "にょん": "뇬",
    "ひゃっ":"햣",  "ひゅっ":"흇",    "ひょっ":"횻",    "ひゃん":"햔",  "ひゅん":"휸",    "ひょん":"횬",
    "みゃっ":"먓",  "みゅっ":"뮷",    "みょっ":"묫",    "みゃん":"먄",  "みゅん":"뮨",    "みょん":"묜",
    "りゃっ":"럇",  "りゅっ":"륫",    "りょっ":"룟",    "りゃん":"랸",  "りゅん":"륜",    "りょん":"룐",
    "ぎゃっ":"걋",  "ぎゅっ":"귯",    "ぎょっ":"굣",    "ぎゃん":"갼",  "ぎゅん":"균",    "ぎょん":"굔",
    "じゃっ":"쟛",  "じゅっ":"쥿",    "じょっ":"죳",    "じゃん":"쟌",  "じゅん":"쥰",    "じょん":"죤",
    "ぢゃっ":"쟛",  "ぢゅっ":"쥿",    "ぢょっ":"죳",    "ぢゃん":"쟌",  "ぢゅん":"쥰",    "ぢょん":"죤",
    "びゃっ":"뱟",  "びゅっ":"븃",    "びょっ":"뵷",    "びゃん":"뱐",  "びゅん":"뷴",    "びょん":"뵨",
    "ぴゃっ":"퍗",  "ぴゅっ":"퓻",    "ぴょっ":"푯",    "ぴゃん":"퍈",  "ぴゅん":"퓬",    "ぴょん":"푠",
    "キャッ":"캿",  "キュッ":"큣",    "キョッ":"쿗",    "キャン":"캰",  "キュン": "큔",   "キョン": "쿈",
    "シャッ":"샷",  "シュッ":"슛",    "ショッ":"숏",    "シャン":"샨",  "シュン": "슌",   "ション": "숀",
    "チャッ":"챳",  "チュッ":"츗",    "チョッ":"춋",    "チャン":"챤",  "チュン": "츈",   "チョン": "쵼",
    "ニャッ":"냣",  "ニュッ":"늇",    "ニョッ":"뇻",    "ニャン":"냔",  "ニュン": "뉸",   "ニョン": "뇬",
    "ヒャッ":"햣",  "ヒュッ":"흇",    "ヒョッ":"횻",    "ヒャン":"햔",  "ヒュン": "휸",   "ヒョン": "횬",
    "ミャッ":"먓",  "ミュッ":"뮷",    "ミョッ":"묫",    "ミャン":"먄",  "ミュン": "뮨",   "ミョン": "묜",
    "リャッ":"럇",  "リュッ":"륫",    "リョッ":"룟",    "リャン":"랸",  "リュン": "륜",   "リョン": "룐",
    "ギャッ":"걋",  "ギュッ":"귯",    "ギョッ":"굣",    "ギャン":"갼",  "ギュン": "균",   "ギョン": "굔",
    "ジャッ":"쟛",  "ジュッ":"쥿",    "ジョッ":"죳",    "ジャン":"쟌",  "ジュン": "쥰",   "ジョン": "죤",
    "ヂャッ":"쟛",  "ヂュッ":"쥿",    "ヂョッ":"춋",    "ヂャン":"쟌",  "ヂュン": "쥰",   "ヂョン": "죤",
    "ビャッ":"뱟",  "ビュッ":"븃",    "ビョッ":"뵷",    "ビャン":"뱐",  "ビュン": "뷴",   "ビョン": "뵨",
    "ピャッ":"퍗",  "ピュッ":"퓻",    "ピョッ":"푯",    "ピャン":"퍈",  "ピュン": "퓬",   "ピョン": "푠",

    "イェッ": "옜","ウァッ": "왓","ウォッ": "웟","ウィッ": "윗","エィッ": "잇",
    "キェッ": "콋","クァッ": "쾃","クォッ": "퀏","クィッ": "큇","ケィッ": "킷",
    "シェッ": "솃","スァッ": "솻","スォッ": "쉇","スィッ": "쉿","セィッ": "싯",
    "チェッ": "쳿","ツァッ": "촷","ツォッ": "췃","ツィッ": "췻","ティッ": "팃",
    "ニェッ": "넷","ヌァッ": "놧","ヌォッ": "눳","ヌィッ": "뉫","ネィッ": "닛",
    "ヒェッ": "헷","ファッ": "홧","フォッ": "훳","フィッ": "휫","ヘィッ": "힛",
    "ミェッ": "멧","ムァッ": "뫗","ムォッ": "뭣","ムィッ": "뮛","メィッ": "밋",
    "リェッ": "렛","ルァッ": "뢋","ルォッ": "뤗","ルィッ": "륏","レィッ": "릿",
    "ギェッ": "겟","グァッ": "괏","グォッ": "궛","グィッ": "귓","ゲィッ": "깃",
    "ジェッ": "젯","ズァッ": "좟","ズォッ": "줫","ズィッ": "쥣","ゼィッ": "짓",
    "ヂェッ": "젯","ヅァッ": "좟","ヅォッ": "줫","ヅィッ": "쥣","ディッ": "짓",
    "ビェッ": "벳","ブァッ": "봣","ブォッ": "붯","ブィッ": "뷧","ベィッ": "빗",
    "ピェッ": "펫","プァッ": "퐛","プォッ": "폿","プィッ": "퓟","ペィッ": "핏",
    "ユェッ": "옛","ヨァッ": "얏","ヨォッ": "엿","ヨィッ": "윳","ワィッ": "잇",


    "イェン": "옌","ウァン": "완","ウォン": "원","ウィン": "윈","エィン": "잉",
    "キェン": "켄","クァン": "콴","クォン": "퀀","クィン": "퀸","ケィン": "킹",
    "シェン": "셴","スァン": "솬","スォン": "숸","スィン": "쉰","セィン": "신",
    "チェン": "첸","ツァン": "촨","ツォン": "춴","ツィン": "췬","ティン": "틴",
    "ニェン": "넨","ヌァン": "놘","ヌォン": "눤","ヌィン": "뉭","ネィン": "닝",
    "ヒェン": "헨","ファン": "환","フォン": "훤","フィン": "휭","ヘィン": "힝",
    "ミェン": "멘","ムァン": "뫈","ムォン": "뭔","ムィン": "뮝","メィン": "밍",
    "リェン": "렌","ルァン": "롼","ルォン": "뤈","ルィン": "륑","レィン": "린",
    "ギェン": "겐","グァン": "관","グォン": "권","グィン": "귄","ゲィン": "깅",
    "ジェン": "젠","ズァン": "좐","ズォン": "줜","ズィン": "쥔","ゼィン": "징",
    "ヂェン": "젠","ヅァン": "좐","ヅォン": "줜","ヅィン": "쥔","ディン": "진",
    "ビェン": "벤","ブァン": "봔","ブォン": "붠","ブィン": "뷘","ベィン": "빙",
    "ピェン": "펜","プァン": "퐌","プォン": "폰","プィン": "퓐","ペィン": "핀",
    "ユェン": "옌","ヨァン": "얀","ヨォン": "용","ヨィン": "윙","ワィン": "인",

}


tsuun_to_hangul = {
    "あっ": "앗","いっ": "잇","うっ": "잇","えっ": "엣","おっ": "옷",
    "かっ": "캇","きっ": "킷","くっ": "킷","けっ": "켓","こっ": "콧",
    "さっ": "삿","しっ": "싯","すっ": "싯","せっ": "셋","そっ": "솟",
    "たっ": "탓","ちっ": "칫","つっ": "칫","てっ": "텟","とっ": "톳",
    "なっ": "낫","にっ": "닛","ぬっ": "닛","ねっ": "넷","のっ": "놋",
    "はっ": "핫","ひっ": "힛","ふっ": "힛","へっ": "헷","ほっ": "홋",
    "まっ": "맛","みっ": "밋","むっ": "밋","めっ": "멧","もっ": "못",
    "らっ": "랏","りっ": "릿","るっ": "릿","れっ": "렛","ろっ": "롯",
    "がっ": "갓","ぎっ": "깃","ぐっ": "깃","げっ": "겟","ごっ": "곳",
    "ざっ": "잣","じっ": "짓","ずっ": "짓","ぜっ": "젯","ぞっ": "좃",
    "だっ": "닷","ぢっ": "짓","づっ": "짓","でっ": "뎃","どっ": "돗",
    "ばっ": "밧","びっ": "빗","ぶっ": "빗","べっ": "벳","ぼっ": "봇",
    "ぱっ": "팟","ぴっ": "핏","ぷっ": "핏","ぺっ": "펫","ぽっ": "폿",
    "やっ": "얏","ゆっ": "윳","よっ": "윳", "わっ": "왓", "をっ": "옷",

    "アッ": "앗","イッ": "잇","ウッ": "잇","エッ": "엣","オッ": "옷",
    "カッ": "캇","キッ": "킷","クッ": "킷","ケッ": "켓","コッ": "콧",
    "サッ": "삿","シッ": "싯","スッ": "싯","セッ": "셋","ソッ": "솟",
    "タッ": "탓","チッ": "칫","ツッ": "칫","テッ": "텟","トッ": "톳",
    "ナッ": "낫","ニッ": "닛","ヌッ": "닛","ネッ": "넷","ノッ": "놋",
    "ハッ": "핫","ヒッ": "힛","フッ": "힛","ヘッ": "헷","ホッ": "홋",
    "マッ": "맛","ミッ": "밋","ムッ": "밋","メッ": "멧","モッ": "못",
    "ラッ": "랏","リッ": "릿","ルッ": "릿","レッ": "렛","ロッ": "롯",
    "ガッ": "갓","ギッ": "깃","グッ": "깃","ゲッ": "겟","ゴッ": "곳",
    "ザッ": "잣","ジッ": "짓","ズッ": "짓","ゼッ": "젯","ゾッ": "좃",
    "ダッ": "닷","ヂッ": "짓","ヅッ": "짓","デッ": "뎃","ドッ": "돗",
    "バッ": "밧","ビッ": "빗","ブッ": "빗","ベッ": "벳","ボッ": "봇",
    "パッ": "팟","ピッ": "핏","プッ": "핏","ペッ": "펫","ポッ": "폿",
    "ヤッ": "얏","ユッ": "윳","ヨッ": "윳","ワッ": "왓","ヲッ": "옷옷",

    "あん": "안","いん": "인","うん": "운","えん": "엔","おん": "온",
    "かん": "칸","きん": "킨","くん": "쿤","けん": "켄","こん": "콘",
    "さん": "산","しん": "신","すん": "슨","せん": "센","そん": "손",
    "たん": "탄","ちん": "친","つん": "츤","てん": "텐","とん": "톤",
    "なん": "난","にん": "닌","ぬん": "눈","ねん": "넨","のん": "논",
    "はん": "한","ひん": "힌","ふん": "훈","へん": "헨","ほん": "혼",
    "まん": "만","みん": "민","むん": "문","めん": "멘","もん": "몬",
    "らん": "란","りん": "린","るん": "룬","れん": "렌","ろん": "론",
    "がん": "간","ぎん": "긴","ぐん": "군","げん": "겐","ごん": "곤",
    "ざん": "잔","じん": "진","ずん": "준","ぜん": "젠","ぞん": "존",
    "だん": "단","ぢん": "진","づん": "둔","でん": "덴","どん": "돈",
    "ばん": "반","びん": "빈","ぶん": "분","べん": "벤","ぼん": "본",
    "ぱん": "판","ぴん": "핀","ぷん": "푼","ぺん": "펜","ぽん": "폰",
    "やん": "얀","ゆん": "윤","よん": "욘",

    "アン": "안","イン": "인","ウン": "운","エン": "엔","オン": "온",
    "カン": "칸","キン": "킨","クン": "쿤","ケン": "켄","コン": "콘",
    "サン": "산","シン": "신","スン": "슨","セン": "센","ソン": "손",
    "タン": "탄","チン": "친","ツン": "츤","テン": "텐","トン": "톤",
    "ナン": "난","ニン": "닌","ヌン": "눈","ネン": "넨","ノン": "논",
    "ハン": "한","ヒン": "힌","フン": "훈","ヘン": "헨","ホン": "혼",
    "マン": "만","ミン": "민","ムン": "문","メン": "멘","モン": "몬",
    "ラン": "란","リン": "린","ルン": "룬","レン": "렌","ロン": "론",
    "ガン": "간","ギン": "긴","グン": "군","ゲン": "겐","ゴン": "곤",
    "ザン": "잔","ジン": "진","ズン": "준","ゼン": "젠","ゾン": "존",
    "ダン": "단","ヂン": "진","ヅン": "둔","デン": "덴","ドン": "돈",
    "バン": "반","ビン": "빈","ブン": "분","ベン": "벤","ボン": "본",
    "パン": "판","ピン": "핀","プン": "푼","ペン": "펜","ポン": "폰",
    "ヤン": "얀","ユン": "윤","ヨン": "욘",

    "イェ": "예","ウァ": "와","ウォ": "워","ウィ": "위","エィ": "이",
    "キェ": "켸","クァ": "콰","クォ": "쿼","クィ": "퀴","ケィ": "키",
    "シェ": "셰","スァ": "솨","スォ": "숴","スィ": "쉬","セィ": "시",
    "チェ": "체","ツァ": "촤","ツォ": "춰","ツィ": "취","ティ": "티",
    "ニェ": "네","ヌァ": "놔","ヌォ": "눠","ヌィ": "뉘","ネィ": "니",
    "ヒェ": "헤","ファ": "화","フォ": "훠","フィ": "휘","ヘィ": "히",
    "ミェ": "메","ムァ": "뫄","ムォ": "뭐","ムィ": "뮈","メィ": "미",
    "リェ": "레","ルァ": "롸","ルォ": "뤄","ルィ": "뤼","レィ": "리",
    "ギェ": "게","グァ": "과","グォ": "궈","グィ": "귀","ゲィ": "기",
    "ジェ": "제","ズァ": "좌","ズォ": "줘","ズィ": "쥐","ゼィ": "지",
    "ヂェ": "제","ヅァ": "좌","ヅォ": "줘","ヅィ": "쥐","ディ": "지",
    "ビェ": "베","ブァ": "봐","ブォ": "붜","ブィ": "뷔","ベィ": "비",
    "ピェ": "페","プァ": "퐈","プォ": "포","プィ": "퓌","ペィ": "피",
    "ユェ": "예","ヨァ": "야","ヨォ": "여","ヨィ": "위","ワィ": "이",

}


yo_to_hangul = {
    "きゃ": "캬","きゅ": "큐","きょ": "쿄",
    "しゃ": "샤","しゅ": "슈","しょ": "쇼",
    "ちゃ": "차","ちゅ": "츄","ちょ": "쵸",
    "にゃ": "냐","にゅ": "뉴","にょ": "뇨",
    "ひゃ":"햐", "ひゅ":"휴", "ひょ":"효",
    "みゃ":"먀", "みゅ":"뮤", "みょ":"묘",
    "りゃ":"랴", "りゅ":"류", "りょ":"료",
    "ぎゃ":"갸", "ぎゅ":"규", "ぎょ":"교",
    "じゃ":"쟈", "じゅ":"쥬", "じょ":"죠",
    "ぢゃ":"쟈", "ぢゅ":"쥬", "ぢょ":"죠",
    "びゃ":"뱌", "びゅ":"뷰", "びょ":"뵤",
    "ぴゃ":"퍄", "ぴゅ":"퓨", "ぴょ":"표",
    "キャ": "캬", "キュ": "큐", "キョ": "쿄",
    "シャ": "샤", "シュ": "슈", "ショ": "쇼",
    "チャ": "챠", "チュ": "츄", "チョ": "쵸",
    "ニャ": "냐", "ニュ": "뉴", "ニョ": "뇨",
    "ヒャ": "햐", "ヒュ": "휴", "ヒョ": "효",
    "ミャ": "먀", "ミュ": "뮤", "ミョ": "묘",
    "リャ": "랴", "リュ": "류", "リョ": "료",
    "ギャ": "갸", "ギュ": "규", "ギョ": "교",
    "ジャ": "쟈", "ジュ": "쥬", "ジョ": "죠",
    "ヂャ": "쟈", "ヂュ": "쥬", "ヂョ": "죠",
    "ビャ": "뱌", "ビュ": "뷰", "ビョ": "뵤",
    "ピャ": "퍄", "ピュ": "퓨", "ピョ": "표",
}

kana_to_hangul = {    
    "あ": "아","い": "이","う": "우","え": "에","お": "오",
    "か": "카","き": "키","く": "쿠","け": "케","こ": "코",
    "さ": "사","し": "시","す": "스","せ": "세","そ": "소",
    "た": "타","ち": "치","つ": "츠","て": "테","と": "토",
    "な": "나","に": "니","ぬ": "누","ね": "네","の": "노",
    "は": "하","ひ": "히","ふ": "후","へ": "헤","ほ": "호",
    "ま": "마","み": "미","む": "무","め": "메","も": "모",
    "や": "야","ゆ": "유","よ": "요",
    "ら": "라","り": "리","る": "루","れ": "레","ろ": "로",
    "わ": "와","を": "오","ん": "은",
    "が": "가","ぎ": "기","ぐ": "구","げ": "게","ご": "고",
    "ざ": "자","じ": "지","ず": "즈","ぜ": "제","ぞ": "조",
    "だ": "다","ぢ": "디","づ": "두","で": "데","ど": "도",
    "ば": "바","び": "비","ぶ": "부","べ": "베","ぼ": "보",
    "ぱ": "파","ぴ": "피","ぷ": "부","ぺ": "페","ぽ": "포",
    "ア": "아","イ": "이","ウ": "우","エ": "에","オ": "오",
    "カ": "카","キ": "키","ク": "쿠","ケ": "케","コ": "코",
    "サ": "사","シ": "시","ス": "스","セ": "세","ソ": "소",
    "タ": "타","チ": "치","ツ": "츠","テ": "테","ト": "토",
    "ナ": "나","ニ": "니","ヌ": "누","ネ": "네","ノ": "노",
    "ハ": "하","ヒ": "히","フ": "후","ヘ": "헤","ホ": "호",
    "マ": "마","ミ": "미","ム": "무","メ": "메","モ": "모",
    "ヤ": "야","ユ": "유","ヨ": "요",
    "ラ": "라","リ": "리","ル": "루","レ": "레","ロ": "로",
    "ワ": "와","ヲ": "오","ン": "은",
    "ガ": "가","ギ": "기","グ": "구","ゲ": "게","ゴ": "고",
    "ザ": "자","ジ": "지","ズ": "즈","ゼ": "제","ゾ": "조",
    "ダ": "다","ヂ": "디","ヅ": "두","デ": "데","ド": "도",
    "バ": "바","ビ": "비","ブ": "부","ベ": "베","ボ": "보",
    "パ": "파","ピ": "피","プ": "부","ペ": "페","ポ": "포",
}

def to_hangul(kana):
    hangul = ""
    i = 0
    while (i < len(kana)):
        if i < len(kana)-2:
            s3 = kana[i:i+3]
            if s3 in yo_tsuun_to_hangul:
                hangul += yo_tsuun_to_hangul[s3]
                i += 3
                continue
        if i < len(kana)-1:
            s2 = kana[i:i+2]
            if s2 in tsuun_to_hangul:
                hangul += tsuun_to_hangul[s2]
                i += 2
                continue
            elif s2 in yo_to_hangul:
                hangul += yo_to_hangul[s2]
                i += 2
                continue
        s1 = kana[i]
        if s1 in kana_to_hangul:
            hangul += kana_to_hangul[s1]
        elif s1 in ["ー","-"]:
            hangul += " "        
        elif s1 in ["/","(",")"]:
            hangul += s1
        else:
            hangul += s1
            #print(kana, "     ", s1)
        i += 1
    return hangul

with open("JLPTwords.txt", "r", encoding="utf-8") as file:
    tsv = ""
    for line in file:
        japanese = line.split(",")[0].split("N")[0]
        kana =japanese.split("[")[0]
        writing = kana
        if len(japanese.split("[")) > 1:
            writing = japanese.split("[")[1].split("]")[0]
        hangul = to_hangul(kana.strip())
        korean = line.split(",")[1].strip("\n")
        grade = "N"+line.split(",")[0].split("N")[1]
        tsv += writing + "\t" + kana + "\t" + hangul + "\t" +  korean + "\t" + grade + "\n"

    print(tsv)
    #print(tsv)
    with open("JLPTwords_tsv.txt", "w", encoding="utf-8") as file:
        file.write(tsv)








